mesh_fluid/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat csv;

interpolationScheme cellPoint;

sets
(
    line
    {
        type    uniform;
        axis    z;
        start   (1.25 0 -0.5);
        end     (1.25 1 0.5);
        nPoints 101;
    }
);

fields (kMean omegaMean nutMean);

// *********************************************************************** //
